[
  {
    "id": 1,
    "name": "Bulbasaur",
    "description": "Bulbasaur, a Grass type pokemon, For some time after its birth, it grows by gaining nourishment from the seed on its back.",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 2,
    "name": "Ivysaur",
    "description": "Ivysaur, a Grass type pokemon, When the bud on its back starts swelling, a sweet aroma wafts to indicate the flowers coming bloom.",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 3,
    "name": "Venusaur",
    "description": "Venusaur, a Grass type pokemon, After a rainy day, the flower on its back smells stronger. The scent attracts other Pokemon.",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 4,
    "name": "Charmander",
    "description": "Charmander, a Fire type pokemon, The fire on the tip of its tail is a measure of its life. If healthy, its tail burns intensely.",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 5,
    "name": "Charmeleon",
    "description": "Charmeleon, a Fire type pokemon, In the rocky mountains where Charmeleon live, their fiery tails shine at night like stars.",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 6,
    "name": "Charizard",
    "description": "Charizard, a Fire type pokemon, It is said that Charizards fire burns hotter if it has experienced harsh battles.",
    "types": [
      "Fire",
      "Flying"
    ]
  },
  {
    "id": 7,
    "name": "Squirtle",
    "description": "Squirtle, a Water type pokemon, It shelters itself in its shell then strikes back with spouts of water at every opportunity.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 8,
    "name": "Wartortle",
    "description": "Wartortle, a Water type pokemon, It is said to live 10,000 years. Its furry tail is popular as a symbol of longevity.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 9,
    "name": "Blastoise",
    "description": "Blastoise, a Water type pokemon, The jets of water it spouts from the rocket cannons on its shell can punch through thick steel.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 10,
    "name": "Caterpie",
    "description": "Caterpie, a Bug type pokemon, It releases a stench from its red antenna to repel enemies. It grows by molting repeatedly.",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 11,
    "name": "Metapod",
    "description": "Metapod, a Bug type pokemon, A steel-hard shell protects its tender body. It quietly endures hardships while awaiting evolution.",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 12,
    "name": "Butterfree",
    "description": "Butterfree, a Bug type pokemon, It loves the honey of flowers and can locate flower patches that have even tiny amounts of pollen.",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 13,
    "name": "Weedle",
    "description": "Weedle, a Bug type pokemon, It eats its weight in leaves every day. It fends off attackers with the needle on its head.",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 14,
    "name": "Kakuna",
    "description": "Kakuna, a Bug type pokemon, While awaiting evolution, it hides from predators under leaves and in nooks of branches.",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 15,
    "name": "Beedrill",
    "description": "Beedrill, a Bug type pokemon, Its best attack involves flying around at high speed, striking with poison needles, then flying off.",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 16,
    "name": "Pidgey",
    "description": "Pidgey, a Normal type pokemon, It is docile and prefers to avoid conflict. If disturbed, however, it can ferociously strike back.",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 17,
    "name": "Pidgeotto",
    "description": "Pidgeotto, a Normal type pokemon, It flies over its wide territory in search of prey, downing it with its highly developed claws.",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 18,
    "name": "Pidgeot",
    "description": "Pidgeot, a Normal type pokemon, It flies over its wide territory in search of prey, downing it with its highly developed claws.",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 19,
    "name": "Rattata",
    "description": "Rattata, a Normal type pokemon, It searches for food all day. It gnaws on hard objects to wear down its fangs, which grow constantly during its lifetime.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 20,
    "name": "Raticate",
    "description": "Raticate, a Normal type pokemon, With its long fangs, this surprisingly violent Pokemon can gnaw away even thick concrete with ease.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 21,
    "name": "Spearow",
    "description": "Spearow, a Normal type pokemon, It flaps its small wings busily to fly. Using its beak, it searches in grass for prey.",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 22,
    "name": "Fearow",
    "description": "Fearow, a Normal type pokemon, It has the stamina to fly all day on its broad wings. It fights by using its sharp beak.",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 23,
    "name": "Ekans",
    "description": "Ekans, a Poison type pokemon, It sneaks through grass without making a sound and strikes unsuspecting prey from behind.",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 24,
    "name": "Arbok",
    "description": "Arbok, a Poison type pokemon, The pattern on its belly is for intimidation. It constricts foes while they are frozen in fear.",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 25,
    "name": "Pikachu",
    "description": "Pikachu, an Electric type pokemon, It occasionally uses an electric shock to recharge a fellow Pikachu that is in a weakened state.",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 26,
    "name": "Raichu",
    "description": "Raichu, an Electric type pokemon, Its tail discharges electricity into the ground, protecting it from getting shocked.",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 27,
    "name": "Sandshrew",
    "description": "Sandshrew, a Ground type pokemon, It digs deep burrows to live in. When in danger, it rolls up its body to withstand attacks.",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 28,
    "name": "Sandslash",
    "description": "Sandslash, a Ground type pokemon, The spikes on its body are made up of its hardened hide. It rolls up and attacks foes with its spikes.",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 29,
    "name": "Nidoranâ™€",
    "description": "Nidoranâ™€, a Poison type pokemon, While it does not prefer to fight, even one drop of the poison it secretes from barbs can be fatal.",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 30,
    "name": "Nidorina",
    "description": "Nidorina, a Poison type pokemon, When it senses danger, it raises all the barbs on its body. These barbs grow slower than Nidorinos.",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 31,
    "name": "Nidoqueen",
    "description": "Nidoqueen, a Poison type pokemon, Its entire body is armored with hard scales. It will protect the young in its burrow with its life.",
    "types": [
      "Poison",
      "Ground"
    ]
  },
  {
    "id": 32,
    "name": "Nidoranâ™‚",
    "description": "Nidoranâ™‚, a Poison type pokemon, It scans its surroundings by raising its ears out of the grass. Its toxic horn is for protection.",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 33,
    "name": "Nidorino",
    "description": "Nidorino, a Poison type pokemon, It has a violent disposition and stabs foes with its horn, which oozes poison upon impact.",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 34,
    "name": "Nidoking",
    "description": "Nidoking, a Poison type pokemon, One swing of its mighty tail can snap a telephone pole as if it were a matchstick.",
    "types": [
      "Poison",
      "Ground"
    ]
  },
  {
    "id": 35,
    "name": "Clefairy",
    "description": "Clefairy, a Fairy type pokemon, On nights with a full moon, Clefairy gather from all over and dance. Bathing in moonlight makes them float.",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 36,
    "name": "Clefable",
    "description": "Clefable, a Fairy type pokemon, Their ears are sensitive enough to hear a pin drop from over a mile away, so theyre usually found in quiet places.",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 37,
    "name": "Vulpix",
    "description": "Vulpix, a Fire type pokemon, As each tail grows, its fur becomes more lustrous. When held, it feels slightly warm.",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 38,
    "name": "Ninetales",
    "description": "Ninetales, a Fire type pokemon, Each of its nine tails is imbued with supernatural power, and it can live for a thousand years.",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 39,
    "name": "Jigglypuff",
    "description": "Jigglypuff, a Normal type pokemon, Looking into its cute, round eyes makes it start singing a song so pleasant listeners cant help but fall asleep.",
    "types": [
      "Normal",
      "Fairy"
    ]
  },
  {
    "id": 40,
    "name": "Wigglytuff",
    "description": "Wigglytuff, a Normal type pokemon, Its fine fur feels so pleasant, those who accidentally touch it cannot take their hands away.",
    "types": [
      "Normal",
      "Fairy"
    ]
  },
  {
    "id": 41,
    "name": "Zubat",
    "description": "Zubat, a Poison type pokemon, It does not need eyes, because it emits ultrasonic waves to check its surroundings while it flies.",
    "types": [
      "Poison",
      "Flying"
    ]
  },
  {
    "id": 42,
    "name": "Golbat",
    "description": "Golbat, a Poison type pokemon, Flitting around in the dead of night, it sinks its fangs into its prey and drains a nearly fatal amount of blood.",
    "types": [
      "Poison",
      "Flying"
    ]
  },
  {
    "id": 43,
    "name": "Oddish",
    "description": "Oddish, a Grass type pokemon, It often plants its root feet in the ground during the day and sows seeds as it walks about at night.",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 44,
    "name": "Gloom",
    "description": "Gloom, a Grass type pokemon, The honey it drools from its mouth smells so atrocious, it can curl noses more than a mile away.",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 45,
    "name": "Vileplume",
    "description": "Vileplume, a Grass type pokemon, Its petals are the largest in the world. As it walks, it scatters extremely allergenic pollen.",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 46,
    "name": "Paras",
    "description": "Paras, a Bug type pokemon, Mushrooms named tochukaso grow on its back. They grow along with the host Paras.",
    "types": [
      "Bug",
      "Grass"
    ]
  },
  {
    "id": 47,
    "name": "Parasect",
    "description": "Parasect, a Bug type pokemon, A mushroom grown larger than the hosts body controls Parasect. It scatters poisonous spores.",
    "types": [
      "Bug",
      "Grass"
    ]
  },
  {
    "id": 48,
    "name": "Venonat",
    "description": "Venonat, a Bug type pokemon, Its big eyes are actually clusters of tiny eyes. At night, its kind is drawn by light.",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 49,
    "name": "Venomoth",
    "description": "Venomoth, a Bug type pokemon, It flutters its wings to scatter dustlike scales. The scales leach toxins if they contact skin.",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 50,
    "name": "Diglett",
    "description": "Diglett, a Ground type pokemon, A Pokemon that lives underground. Because of its dark habitat, it is repelled by bright sunlight.",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 51,
    "name": "Dugtrio",
    "description": "Dugtrio, a Ground type pokemon, Its three heads move alternately, driving it through tough soil to depths of over 60 miles.",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 52,
    "name": "Meowth",
    "description": "Meowth, a Normal type pokemon, It is nocturnal in nature. If it spots something shiny, its eyes glitter brightly.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 53,
    "name": "Persian",
    "description": "Persian, a Normal type pokemon, A very haughty Pokemon. Among fans, the size of the jewel in its forehead is a topic of much talk.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 54,
    "name": "Psyduck",
    "description": "Psyduck, a Water type pokemon, When headaches stimulate its brain cells, which are usually inactive, it can use a mysterious power.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 55,
    "name": "Golduck",
    "description": "Golduck, a Water type pokemon, When its forehead shines mysteriously, Golduck can use the full extent of its power.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 56,
    "name": "Mankey",
    "description": "Mankey, a Fighting type pokemon, It lives in treetop colonies. If one becomes enraged, the whole colony rampages for no reason.",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 57,
    "name": "Primeape",
    "description": "Primeape, a Fighting type pokemon, It grows angry if you see its eyes and gets angrier if you run. If you beat it, it gets even madder.",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 58,
    "name": "Growlithe",
    "description": "Growlithe, a Fire type pokemon, Extremely loyal to its Trainer, it will bark at those who approach the Trainer unexpectedly and run them out of town.",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 59,
    "name": "Arcanine",
    "description": "Arcanine, a Fire type pokemon, The sight of it running over 6,200 miles in a single day and night has captivated many people.",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 60,
    "name": "Poliwag",
    "description": "Poliwag, a Water type pokemon, Its skin is so thin, its internal organs are visible. It has trouble walking on its newly grown feet.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 61,
    "name": "Poliwhirl",
    "description": "Poliwhirl, a Water type pokemon, The spiral pattern on its belly subtly undulates. Staring at it gradually causes drowsiness.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 62,
    "name": "Poliwrath",
    "description": "Poliwrath, a Water type pokemon, With its extremely tough muscles, it can keep swimming in the Pacific Ocean without resting.",
    "types": [
      "Water",
      "Fighting"
    ]
  },
  {
    "id": 63,
    "name": "Abra",
    "description": "Abra, a Psychic type pokemon, Using its psychic power is such a strain on its brain that it needs to sleep for 18 hours a day.",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 64,
    "name": "Kadabra",
    "description": "Kadabra, a Psychic type pokemon, It stares at its silver spoon to focus its mind. It emits more alpha waves while doing so.",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 65,
    "name": "Alakazam",
    "description": "Alakazam, a Psychic type pokemon, The spoons clutched in its hands are said to have been created by its psychic powers.",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 66,
    "name": "Machop",
    "description": "Machop, a Fighting type pokemon, Though small in stature, it is powerful enough to easily heft and throw a number of Geodude at once.",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 67,
    "name": "Machoke",
    "description": "Machoke, a Fighting type pokemon, It happily carries heavy cargo to toughen up. It willingly does hard work for people.",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 68,
    "name": "Machamp",
    "description": "Machamp, a Fighting type pokemon, Its four muscled arms slam foes with powerful punches and chops at blinding speed.",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 69,
    "name": "Bellsprout",
    "description": "Bellsprout, a Grass type pokemon, It prefers hot and humid environments. It is quick at capturing prey with its vines.",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 70,
    "name": "Weepinbell",
    "description": "Weepinbell, a Grass type pokemon, A Pokemon that appears to be a plant. It captures unwary prey by dousing them with a toxic powder.",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 71,
    "name": "Victreebel",
    "description": "Victreebel, a Grass type pokemon, It pools in its mouth a fluid with a honey-like scent, which is really an acid that dissolves anything.",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 72,
    "name": "Tentacool",
    "description": "Tentacool, a Water type pokemon, Because its body is almost entirely composed of water, it shrivels up if it is washed ashore.",
    "types": [
      "Water",
      "Poison"
    ]
  },
  {
    "id": 73,
    "name": "Tentacruel",
    "description": "Tentacruel, a Water type pokemon, It extends its 80 tentacles to form an encircling poisonous net that is difficult to escape.",
    "types": [
      "Water",
      "Poison"
    ]
  },
  {
    "id": 74,
    "name": "Geodude",
    "description": "Geodude, a Rock type pokemon, At rest, it looks just like a rock. Carelessly stepping on it will make it swing its fists angrily.",
    "types": [
      "Rock",
      "Ground"
    ]
  },
  {
    "id": 75,
    "name": "Graveler",
    "description": "Graveler, a Rock type pokemon, It rolls on mountain paths to move. Once it builds momentum, no Pokemon can stop it without difficulty.",
    "types": [
      "Rock",
      "Ground"
    ]
  },
  {
    "id": 76,
    "name": "Golem",
    "description": "Golem, a Rock type pokemon, Even dynamite cant harm its hard, boulder-like body. It sheds its hide just once a year.",
    "types": [
      "Rock",
      "Ground"
    ]
  },
  {
    "id": 77,
    "name": "Ponyta",
    "description": "Ponyta, a Fire type pokemon, As a newborn, it can barely stand. However, through galloping, its legs are made tougher and faster.",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 78,
    "name": "Rapidash",
    "description": "Rapidash, a Fire type pokemon, When at an all-out gallop, its blazing mane sparkles, enhancing its beautiful appearance.",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 79,
    "name": "Slowpoke",
    "description": "Slowpoke, a Water type pokemon, Although slow, it is skilled at fishing with its tail. It does not feel pain if its tail is bitten.",
    "types": [
      "Water",
      "Psychic"
    ]
  },
  {
    "id": 80,
    "name": "Slowbro",
    "description": "Slowbro, a Water type pokemon, Though usually dim witted, it seems to become inspired if the Shellder on its tail bites down.",
    "types": [
      "Water",
      "Psychic"
    ]
  },
  {
    "id": 81,
    "name": "Magnemite",
    "description": "Magnemite, an Electric type pokemon, The electromagnetic waves emitted by the units at the sides of its head expel antigravity, which allows it to float.",
    "types": [
      "Electric",
      "Steel"
    ]
  },
  {
    "id": 82,
    "name": "Magneton",
    "description": "Magneton, an Electric type pokemon, The stronger electromagnetic waves from the three linked Magnemite are enough to dry out surrounding moisture.",
    "types": [
      "Electric",
      "Steel"
    ]
  },
  {
    "id": 83,
    "name": "Farfetch'd",
    "description": "Farfetch'd, a Normal type pokemon, It cant live without the stalk it holds. Thats why it defends the stalk from attackers with its life.",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 84,
    "name": "Doduo",
    "description": "Doduo, a Normal type pokemon, The brains in its two heads appear to communicate emotions to each other with a telepathic power.",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 85,
    "name": "Dodrio",
    "description": "Dodrio, a Normal type pokemon, When Doduo evolves into this odd breed, one of its heads splits into two. It runs at nearly 40 mph.",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 86,
    "name": "Seel",
    "description": "Seel, a Water type pokemon, The colder it gets, the better it feels. It joyfully swims around oceans so cold that they are filled with floating ice.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 87,
    "name": "Dewgong",
    "description": "Dewgong, a Water type pokemon, Its streamlined body has low resistance, and it swims around cold oceans at a speed of eight knots.",
    "types": [
      "Water",
      "Ice"
    ]
  },
  {
    "id": 88,
    "name": "Grimer",
    "description": "Grimer, a Poison type pokemon, Born from sludge, these Pokemon now gather in polluted places and increase the bacteria in their bodies.",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 89,
    "name": "Muk",
    "description": "Muk, a Poison type pokemon, Its so stinky! Muks body contains toxic elements, and any plant will wilt when it passes by.",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 90,
    "name": "Shellder",
    "description": "Shellder, a Water type pokemon, It swims backward by opening and closing its two shells. Its large tongue is always kept hanging out.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 91,
    "name": "Cloyster",
    "description": "Cloyster, a Water type pokemon, It fights by keeping its shell tightly shut for protection and by shooting spikes to repel foes.",
    "types": [
      "Water",
      "Ice"
    ]
  },
  {
    "id": 92,
    "name": "Gastly",
    "description": "Gastly, a Ghost type pokemon, Born from gases, anyone would faint if engulfed by its gaseous body, which contains poison.",
    "types": [
      "Ghost",
      "Poison"
    ]
  },
  {
    "id": 93,
    "name": "Haunter",
    "description": "Haunter, a Ghost type pokemon, It likes to lurk in the dark and tap shoulders with a gaseous hand. Its touch causes endless shuddering.",
    "types": [
      "Ghost",
      "Poison"
    ]
  },
  {
    "id": 94,
    "name": "Gengar",
    "description": "Gengar, a Ghost type pokemon, The leer that floats in darkness belongs to a Gengar delighting in casting curses on people.",
    "types": [
      "Ghost",
      "Poison"
    ]
  },
  {
    "id": 95,
    "name": "Onix",
    "description": "Onix, a Rock type pokemon, Opening its large mouth, it ingests massive amounts of soil and creates long tunnels.",
    "types": [
      "Rock",
      "Ground"
    ]
  },
  {
    "id": 96,
    "name": "Drowzee",
    "description": "Drowzee, a Psychic type pokemon, It can tell what people are dreaming by sniffing with its big nose. It loves fun dreams.",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 97,
    "name": "Hypno",
    "description": "Hypno, a Psychic type pokemon, Seeing its swinging pendulum can induce sleep in three seconds, even in someone who just woke up.",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 98,
    "name": "Krabby",
    "description": "Krabby, a Water type pokemon, It lives in burrows dug on sandy beaches. Its pincers fully grow back if they are broken in battle.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 99,
    "name": "Kingler",
    "description": "Kingler, a Water type pokemon, The larger pincer has 10,000- horsepower strength. However, it is so heavy, it is difficult to aim.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 100,
    "name": "Voltorb",
    "description": "Voltorb, an Electric type pokemon, It looks just like a Pok Ball. It is dangerous because it may electrocute or explode on contact.",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 101,
    "name": "Electrode",
    "description": "Electrode, an Electric type pokemon, It is known to drift on winds if it is bloated to bursting with stored electricity.",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 102,
    "name": "Exeggcute",
    "description": "Exeggcute, a Grass type pokemon, Its six eggs converse using telepathy. They can quickly gather if they become separated.",
    "types": [
      "Grass",
      "Psychic"
    ]
  },
  {
    "id": 103,
    "name": "Exeggutor",
    "description": "Exeggutor, a Grass type pokemon, It is called The Walking Jungle. If a head grows too big, it falls off and becomes an Exeggcute.",
    "types": [
      "Grass",
      "Psychic"
    ]
  },
  {
    "id": 104,
    "name": "Cubone",
    "description": "Cubone, a Ground type pokemon, When it thinks of its dead mother, it cries. Its crying makes the skull it wears rattle hollowly.",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 105,
    "name": "Marowak",
    "description": "Marowak, a Ground type pokemon, From its birth, this savage Pokemon constantly holds bones. It is skilled in using them as weapons.",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 106,
    "name": "Hitmonlee",
    "description": "Hitmonlee, a Fighting type pokemon, Its legs can stretch double. First-time foes are startled by its extensible reach.",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 107,
    "name": "Hitmonchan",
    "description": "Hitmonchan, a Fighting type pokemon, The arm-twisting punches it throws pulverize even concrete. It rests after three minutes of fighting.",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 108,
    "name": "Lickitung",
    "description": "Lickitung, a Normal type pokemon, Being licked by its long, saliva-covered tongue leaves a tingling sensation. Extending its tongue retracts its tail.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 109,
    "name": "Koffing",
    "description": "Koffing, a Poison type pokemon, Toxic gas is held within its thin, balloon-shaped body, so it can cause massive explosions.",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 110,
    "name": "Weezing",
    "description": "Weezing, a Poison type pokemon, Inhaling toxic fumes from trash and mixing them inside its body lets it spread an even fouler stench.",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 111,
    "name": "Rhyhorn",
    "description": "Rhyhorn, a Ground type pokemon, Its powerful tackles can destroy anything. However, it is too slow witted to help people work.",
    "types": [
      "Ground",
      "Rock"
    ]
  },
  {
    "id": 112,
    "name": "Rhydon",
    "description": "Rhydon, a Ground type pokemon, Standing on its hind legs freed its forelegs and made it smarter. It is very forgetful, however.",
    "types": [
      "Ground",
      "Rock"
    ]
  },
  {
    "id": 113,
    "name": "Chansey",
    "description": "Chansey, a Normal type pokemon, A kindly Pokemon that lays highly nutritious eggs and shares them with injured Pokmon or people.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 114,
    "name": "Tangela",
    "description": "Tangela, a Grass type pokemon, Many writhing vines cover it, so its true identity remains unknown. The blue vines grow its whole life long.",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 115,
    "name": "Kangaskhan",
    "description": "Kangaskhan, a Normal type pokemon, It raises its offspring in its belly pouch. It lets the baby out to play only when it feels safe.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 116,
    "name": "Horsea",
    "description": "Horsea, a Water type pokemon, It makes its nest in the shade of corals. If it senses danger, it spits murky ink and flees.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 117,
    "name": "Seadra",
    "description": "Seadra, a Water type pokemon, Its spines provide protection. Its fins and bones are prized as traditional-medicine ingredients.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 118,
    "name": "Goldeen",
    "description": "Goldeen, a Water type pokemon, Though it appears very elegant when swimming with fins unfurled, it can jab powerfully with its horn.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 119,
    "name": "Seaking",
    "description": "Seaking, a Water type pokemon, In autumn, its body becomes more fatty in preparing to propose to a mate. It takes on beautiful colors.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 120,
    "name": "Staryu",
    "description": "Staryu, a Water type pokemon, As long as its red core remains, it can regenerate its body instantly, even if its torn apart.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 121,
    "name": "Starmie",
    "description": "Starmie, a Water type pokemon, Its core shines in many colors and sends radio signals into space to communicate with something.",
    "types": [
      "Water",
      "Psychic"
    ]
  },
  {
    "id": 122,
    "name": "Mr. Mime",
    "description": "Mr. Mime, a Psychic type pokemon, It shapes an invisible wall in midair by minutely vibrating its fingertips to stop molecules in the air.",
    "types": [
      "Psychic",
      "Fairy"
    ]
  },
  {
    "id": 123,
    "name": "Scyther",
    "description": "Scyther, a Bug type pokemon, The sharp scythes on its forearms become increasingly sharp by cutting through hard objects.",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 124,
    "name": "Jynx",
    "description": "Jynx, a Ice type pokemon, Its cries sound like human speech. However, it is impossible to tell what it is trying to say.",
    "types": [
      "Ice",
      "Psychic"
    ]
  },
  {
    "id": 125,
    "name": "Electabuzz",
    "description": "Electabuzz, an Electric type pokemon, Research is progressing on storing lightning in Electabuzz so this energy can be used at any time.",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 126,
    "name": "Magmar",
    "description": "Magmar, a Fire type pokemon, The scorching fire exhaled by Magmar forms heat waves around its body, making it hard to see the Pokemon clearly.",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 127,
    "name": "Pinsir",
    "description": "Pinsir, a Bug type pokemon, It grips prey with its powerful pincers and will not let go until the prey is torn in half.",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 128,
    "name": "Tauros",
    "description": "Tauros, a Normal type pokemon, Once it takes aim at its foe, it makes a headlong charge. It is famous for its violent nature.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 129,
    "name": "Magikarp",
    "description": "Magikarp, a Water type pokemon, A Magikarp living for many years can leap a mountain using Splash. The move remains useless, though.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 130,
    "name": "Gyarados",
    "description": "Gyarados, a Water type pokemon, Once it begins to rampage, a Gyarados will burn everything down, even in a harsh storm.",
    "types": [
      "Water",
      "Flying"
    ]
  },
  {
    "id": 131,
    "name": "Lapras",
    "description": "Lapras, a Water type pokemon, Able to understand human speech and very intelligent, it loves to swim in the sea with people on its back.",
    "types": [
      "Water",
      "Ice"
    ]
  },
  {
    "id": 132,
    "name": "Ditto",
    "description": "Ditto, a Normal type pokemon, It can reconstitute its entire cellular structure to change into what it sees, but it returns to normal when it relaxes.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 133,
    "name": "Eevee",
    "description": "Eevee, a Normal type pokemon, Thanks to its unstable genetic makeup, this special Pokemon conceals many different possible evolutions.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 134,
    "name": "Vaporeon",
    "description": "Vaporeon, a Water type pokemon, Its cell composition is similar to water molecules. As a result, it cant be seen when it melts away into water.",
    "types": [
      "Water"
    ]
  },
  {
    "id": 135,
    "name": "Jolteon",
    "description": "Jolteon, an Electric type pokemon, By storing electricity in its body, it can shoot its bristlelike fur like a barrage of missiles.",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 136,
    "name": "Flareon",
    "description": "Flareon, a Fire type pokemon, Inhaled air is carried to its flame sac, heated, and exhaled as fire that reaches over 3,000 degrees F.",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 137,
    "name": "Porygon",
    "description": "Porygon, a Normal type pokemon, A man-made Pokemon created using advanced scientific means. It can move freely in cyberspace.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 138,
    "name": "Omanyte",
    "description": "Omanyte, a Rock type pokemon, A Pokemon that was resurrected from a fossil using modern science. It swam in ancient seas.",
    "types": [
      "Rock",
      "Water"
    ]
  },
  {
    "id": 139,
    "name": "Omastar",
    "description": "Omastar, a Rock type pokemon, It is thought that this Pokemon became extinct because its spiral shell grew too large.",
    "types": [
      "Rock",
      "Water"
    ]
  },
  {
    "id": 140,
    "name": "Kabuto",
    "description": "Kabuto, a Rock type pokemon, It is thought to have inhabited beaches 300 million years ago. It is protected by a stiff shell.",
    "types": [
      "Rock",
      "Water"
    ]
  },
  {
    "id": 141,
    "name": "Kabutops",
    "description": "Kabutops, a Rock type pokemon, It is thought that this Pokemon came onto land because its prey adapted to life on land.",
    "types": [
      "Rock",
      "Water"
    ]
  },
  {
    "id": 142,
    "name": "Aerodactyl",
    "description": "Aerodactyl, a Rock type pokemon, A Pokemon that roamed the skies in the dinosaur era. Its teeth are like saw blades.",
    "types": [
      "Rock",
      "Flying"
    ]
  },
  {
    "id": 143,
    "name": "Snorlax",
    "description": "Snorlax, a Normal type pokemon, When its belly is full, it becomes too lethargic to even lift a finger, so it is safe to bounce on its belly.",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 144,
    "name": "Articuno",
    "description": "Articuno, a Ice type pokemon, A legendary bird Pokemon. It can create blizzards by freezing moisture in the air.",
    "types": [
      "Ice",
      "Flying"
    ]
  },
  {
    "id": 145,
    "name": "Zapdos",
    "description": "Zapdos, an Electric type pokemon, A legendary Pokemon that is said to live in thunderclouds. It freely controls lightning bolts.",
    "types": [
      "Electric",
      "Flying"
    ]
  },
  {
    "id": 146,
    "name": "Moltres",
    "description": "Moltres, a Fire type pokemon, One of the legendary bird Pokemon. It is said that its appearance indicates the coming of spring.",
    "types": [
      "Fire",
      "Flying"
    ]
  },
  {
    "id": 147,
    "name": "Dratini",
    "description": "Dratini, a Dragon type pokemon, It is called the Mirage Pokemon because so few have seen it. Its shed skin has been found.",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 148,
    "name": "Dragonair",
    "description": "Dragonair, a Dragon type pokemon, If its body takes on an aura, the weather changes instantly. It is said to live in seas and lakes.",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 149,
    "name": "Dragonite",
    "description": "Dragonite, a Dragon type pokemon, It is said to make its home somewhere in the sea. It guides crews of shipwrecks to shore.",
    "types": [
      "Dragon",
      "Flying"
    ]
  },
  {
    "id": 150,
    "name": "Mewtwo",
    "description": "Mewtwo, a Psychic type pokemon, A Pokemon created by recombining Mews genes. Its said to have the most savage heart among Pokmon.",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 151,
    "name": "Mew",
    "description": "Mew, a Psychic type pokemon, Mew is said to possess the genetic composition of all Pokemon. It is capable of making itself invisible at will, so it entirely avoids notice even if it approaches people.",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 152,
    "name": "Chikorita",
    "description": "Chikorita, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 153,
    "name": "Bayleef",
    "description": "Bayleef, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 154,
    "name": "Meganium",
    "description": "Meganium, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 155,
    "name": "Cyndaquil",
    "description": "Cyndaquil, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 156,
    "name": "Quilava",
    "description": "Quilava, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 157,
    "name": "Typhlosion",
    "description": "Typhlosion, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 158,
    "name": "Totodile",
    "description": "Totodile, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 159,
    "name": "Croconaw",
    "description": "Croconaw, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 160,
    "name": "Feraligatr",
    "description": "Feraligatr, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 161,
    "name": "Sentret",
    "description": "Sentret, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 162,
    "name": "Furret",
    "description": "Furret, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 163,
    "name": "Hoothoot",
    "description": "Hoothoot, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 164,
    "name": "Noctowl",
    "description": "Noctowl, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 165,
    "name": "Ledyba",
    "description": "Ledyba, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 166,
    "name": "Ledian",
    "description": "Ledian, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 167,
    "name": "Spinarak",
    "description": "Spinarak, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 168,
    "name": "Ariados",
    "description": "Ariados, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 169,
    "name": "Crobat",
    "description": "Crobat, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Flying"
    ]
  },
  {
    "id": 170,
    "name": "Chinchou",
    "description": "Chinchou, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Electric"
    ]
  },
  {
    "id": 171,
    "name": "Lanturn",
    "description": "Lanturn, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Electric"
    ]
  },
  {
    "id": 172,
    "name": "Pichu",
    "description": "Pichu, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 173,
    "name": "Cleffa",
    "description": "Cleffa, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 174,
    "name": "Igglybuff",
    "description": "Igglybuff, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Fairy"
    ]
  },
  {
    "id": 175,
    "name": "Togepi",
    "description": "Togepi, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 176,
    "name": "Togetic",
    "description": "Togetic, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy",
      "Flying"
    ]
  },
  {
    "id": 177,
    "name": "Natu",
    "description": "Natu, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Flying"
    ]
  },
  {
    "id": 178,
    "name": "Xatu",
    "description": "Xatu, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Flying"
    ]
  },
  {
    "id": 179,
    "name": "Mareep",
    "description": "Mareep, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 180,
    "name": "Flaaffy",
    "description": "Flaaffy, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 181,
    "name": "Ampharos",
    "description": "Ampharos, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 182,
    "name": "Bellossom",
    "description": "Bellossom, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 183,
    "name": "Marill",
    "description": "Marill, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Fairy"
    ]
  },
  {
    "id": 184,
    "name": "Azumarill",
    "description": "Azumarill, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Fairy"
    ]
  },
  {
    "id": 185,
    "name": "Sudowoodo",
    "description": "Sudowoodo, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 186,
    "name": "Politoed",
    "description": "Politoed, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 187,
    "name": "Hoppip",
    "description": "Hoppip, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Flying"
    ]
  },
  {
    "id": 188,
    "name": "Skiploom",
    "description": "Skiploom, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Flying"
    ]
  },
  {
    "id": 189,
    "name": "Jumpluff",
    "description": "Jumpluff, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Flying"
    ]
  },
  {
    "id": 190,
    "name": "Aipom",
    "description": "Aipom, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 191,
    "name": "Sunkern",
    "description": "Sunkern, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 192,
    "name": "Sunflora",
    "description": "Sunflora, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 193,
    "name": "Yanma",
    "description": "Yanma, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 194,
    "name": "Wooper",
    "description": "Wooper, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ground"
    ]
  },
  {
    "id": 195,
    "name": "Quagsire",
    "description": "Quagsire, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ground"
    ]
  },
  {
    "id": 196,
    "name": "Espeon",
    "description": "Espeon, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 197,
    "name": "Umbreon",
    "description": "Umbreon, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark"
    ]
  },
  {
    "id": 198,
    "name": "Murkrow",
    "description": "Murkrow, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Flying"
    ]
  },
  {
    "id": 199,
    "name": "Slowking",
    "description": "Slowking, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Psychic"
    ]
  },
  {
    "id": 200,
    "name": "Misdreavus",
    "description": "Misdreavus, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost"
    ]
  },
  {
    "id": 201,
    "name": "Unown",
    "description": "Unown, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 202,
    "name": "Wobbuffet",
    "description": "Wobbuffet, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 203,
    "name": "Girafarig",
    "description": "Girafarig, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Psychic"
    ]
  },
  {
    "id": 204,
    "name": "Pineco",
    "description": "Pineco, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 205,
    "name": "Forretress",
    "description": "Forretress, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Steel"
    ]
  },
  {
    "id": 206,
    "name": "Dunsparce",
    "description": "Dunsparce, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 207,
    "name": "Gligar",
    "description": "Gligar, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Flying"
    ]
  },
  {
    "id": 208,
    "name": "Steelix",
    "description": "Steelix, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Ground"
    ]
  },
  {
    "id": 209,
    "name": "Snubbull",
    "description": "Snubbull, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 210,
    "name": "Granbull",
    "description": "Granbull, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 211,
    "name": "Qwilfish",
    "description": "Qwilfish, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Poison"
    ]
  },
  {
    "id": 212,
    "name": "Scizor",
    "description": "Scizor, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Steel"
    ]
  },
  {
    "id": 213,
    "name": "Shuckle",
    "description": "Shuckle, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Rock"
    ]
  },
  {
    "id": 214,
    "name": "Heracross",
    "description": "Heracross, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Fighting"
    ]
  },
  {
    "id": 215,
    "name": "Sneasel",
    "description": "Sneasel, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Ice"
    ]
  },
  {
    "id": 216,
    "name": "Teddiursa",
    "description": "Teddiursa, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 217,
    "name": "Ursaring",
    "description": "Ursaring, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 218,
    "name": "Slugma",
    "description": "Slugma, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 219,
    "name": "Magcargo",
    "description": "Magcargo, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Rock"
    ]
  },
  {
    "id": 220,
    "name": "Swinub",
    "description": "Swinub, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice",
      "Ground"
    ]
  },
  {
    "id": 221,
    "name": "Piloswine",
    "description": "Piloswine, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice",
      "Ground"
    ]
  },
  {
    "id": 222,
    "name": "Corsola",
    "description": "Corsola, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Rock"
    ]
  },
  {
    "id": 223,
    "name": "Remoraid",
    "description": "Remoraid, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 224,
    "name": "Octillery",
    "description": "Octillery, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 225,
    "name": "Delibird",
    "description": "Delibird, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice",
      "Flying"
    ]
  },
  {
    "id": 226,
    "name": "Mantine",
    "description": "Mantine, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Flying"
    ]
  },
  {
    "id": 227,
    "name": "Skarmory",
    "description": "Skarmory, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Flying"
    ]
  },
  {
    "id": 228,
    "name": "Houndour",
    "description": "Houndour, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Fire"
    ]
  },
  {
    "id": 229,
    "name": "Houndoom",
    "description": "Houndoom, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Fire"
    ]
  },
  {
    "id": 230,
    "name": "Kingdra",
    "description": "Kingdra, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Dragon"
    ]
  },
  {
    "id": 231,
    "name": "Phanpy",
    "description": "Phanpy, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 232,
    "name": "Donphan",
    "description": "Donphan, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 233,
    "name": "Porygon2",
    "description": "Porygon2, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 234,
    "name": "Stantler",
    "description": "Stantler, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 235,
    "name": "Smeargle",
    "description": "Smeargle, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 236,
    "name": "Tyrogue",
    "description": "Tyrogue, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 237,
    "name": "Hitmontop",
    "description": "Hitmontop, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 238,
    "name": "Smoochum",
    "description": "Smoochum, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice",
      "Psychic"
    ]
  },
  {
    "id": 239,
    "name": "Elekid",
    "description": "Elekid, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 240,
    "name": "Magby",
    "description": "Magby, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 241,
    "name": "Miltank",
    "description": "Miltank, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 242,
    "name": "Blissey",
    "description": "Blissey, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 243,
    "name": "Raikou",
    "description": "Raikou, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 244,
    "name": "Entei",
    "description": "Entei, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 245,
    "name": "Suicune",
    "description": "Suicune, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 246,
    "name": "Larvitar",
    "description": "Larvitar, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Ground"
    ]
  },
  {
    "id": 247,
    "name": "Pupitar",
    "description": "Pupitar, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Ground"
    ]
  },
  {
    "id": 248,
    "name": "Tyranitar",
    "description": "Tyranitar, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Dark"
    ]
  },
  {
    "id": 249,
    "name": "Lugia",
    "description": "Lugia, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Flying"
    ]
  },
  {
    "id": 250,
    "name": "Ho-Oh",
    "description": "Ho-Oh, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Flying"
    ]
  },
  {
    "id": 251,
    "name": "Celebi",
    "description": "Celebi, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Grass"
    ]
  },
  {
    "id": 252,
    "name": "Treecko",
    "description": "Treecko, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 253,
    "name": "Grovyle",
    "description": "Grovyle, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 254,
    "name": "Sceptile",
    "description": "Sceptile, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 255,
    "name": "Torchic",
    "description": "Torchic, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 256,
    "name": "Combusken",
    "description": "Combusken, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Fighting"
    ]
  },
  {
    "id": 257,
    "name": "Blaziken",
    "description": "Blaziken, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Fighting"
    ]
  },
  {
    "id": 258,
    "name": "Mudkip",
    "description": "Mudkip, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 259,
    "name": "Marshtomp",
    "description": "Marshtomp, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ground"
    ]
  },
  {
    "id": 260,
    "name": "Swampert",
    "description": "Swampert, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ground"
    ]
  },
  {
    "id": 261,
    "name": "Poochyena",
    "description": "Poochyena, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark"
    ]
  },
  {
    "id": 262,
    "name": "Mightyena",
    "description": "Mightyena, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark"
    ]
  },
  {
    "id": 263,
    "name": "Zigzagoon",
    "description": "Zigzagoon, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 264,
    "name": "Linoone",
    "description": "Linoone, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 265,
    "name": "Wurmple",
    "description": "Wurmple, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 266,
    "name": "Silcoon",
    "description": "Silcoon, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 267,
    "name": "Beautifly",
    "description": "Beautifly, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 268,
    "name": "Cascoon",
    "description": "Cascoon, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 269,
    "name": "Dustox",
    "description": "Dustox, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 270,
    "name": "Lotad",
    "description": "Lotad, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Grass"
    ]
  },
  {
    "id": 271,
    "name": "Lombre",
    "description": "Lombre, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Grass"
    ]
  },
  {
    "id": 272,
    "name": "Ludicolo",
    "description": "Ludicolo, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Grass"
    ]
  },
  {
    "id": 273,
    "name": "Seedot",
    "description": "Seedot, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 274,
    "name": "Nuzleaf",
    "description": "Nuzleaf, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Dark"
    ]
  },
  {
    "id": 275,
    "name": "Shiftry",
    "description": "Shiftry, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Dark"
    ]
  },
  {
    "id": 276,
    "name": "Taillow",
    "description": "Taillow, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 277,
    "name": "Swellow",
    "description": "Swellow, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 278,
    "name": "Wingull",
    "description": "Wingull, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Flying"
    ]
  },
  {
    "id": 279,
    "name": "Pelipper",
    "description": "Pelipper, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Flying"
    ]
  },
  {
    "id": 280,
    "name": "Ralts",
    "description": "Ralts, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Fairy"
    ]
  },
  {
    "id": 281,
    "name": "Kirlia",
    "description": "Kirlia, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Fairy"
    ]
  },
  {
    "id": 282,
    "name": "Gardevoir",
    "description": "Gardevoir, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Fairy"
    ]
  },
  {
    "id": 283,
    "name": "Surskit",
    "description": "Surskit, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Water"
    ]
  },
  {
    "id": 284,
    "name": "Masquerain",
    "description": "Masquerain, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 285,
    "name": "Shroomish",
    "description": "Shroomish, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 286,
    "name": "Breloom",
    "description": "Breloom, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Fighting"
    ]
  },
  {
    "id": 287,
    "name": "Slakoth",
    "description": "Slakoth, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 288,
    "name": "Vigoroth",
    "description": "Vigoroth, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 289,
    "name": "Slaking",
    "description": "Slaking, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 290,
    "name": "Nincada",
    "description": "Nincada, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Ground"
    ]
  },
  {
    "id": 291,
    "name": "Ninjask",
    "description": "Ninjask, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 292,
    "name": "Shedinja",
    "description": "Shedinja, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Ghost"
    ]
  },
  {
    "id": 293,
    "name": "Whismur",
    "description": "Whismur, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 294,
    "name": "Loudred",
    "description": "Loudred, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 295,
    "name": "Exploud",
    "description": "Exploud, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 296,
    "name": "Makuhita",
    "description": "Makuhita, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 297,
    "name": "Hariyama",
    "description": "Hariyama, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 298,
    "name": "Azurill",
    "description": "Azurill, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Fairy"
    ]
  },
  {
    "id": 299,
    "name": "Nosepass",
    "description": "Nosepass, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 300,
    "name": "Skitty",
    "description": "Skitty, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 301,
    "name": "Delcatty",
    "description": "Delcatty, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 302,
    "name": "Sableye",
    "description": "Sableye, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Ghost"
    ]
  },
  {
    "id": 303,
    "name": "Mawile",
    "description": "Mawile, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Fairy"
    ]
  },
  {
    "id": 304,
    "name": "Aron",
    "description": "Aron, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Rock"
    ]
  },
  {
    "id": 305,
    "name": "Lairon",
    "description": "Lairon, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Rock"
    ]
  },
  {
    "id": 306,
    "name": "Aggron",
    "description": "Aggron, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Rock"
    ]
  },
  {
    "id": 307,
    "name": "Meditite",
    "description": "Meditite, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting",
      "Psychic"
    ]
  },
  {
    "id": 308,
    "name": "Medicham",
    "description": "Medicham, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting",
      "Psychic"
    ]
  },
  {
    "id": 309,
    "name": "Electrike",
    "description": "Electrike, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 310,
    "name": "Manectric",
    "description": "Manectric, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 311,
    "name": "Plusle",
    "description": "Plusle, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 312,
    "name": "Minun",
    "description": "Minun, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 313,
    "name": "Volbeat",
    "description": "Volbeat, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 314,
    "name": "Illumise",
    "description": "Illumise, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 315,
    "name": "Roselia",
    "description": "Roselia, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 316,
    "name": "Gulpin",
    "description": "Gulpin, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 317,
    "name": "Swalot",
    "description": "Swalot, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 318,
    "name": "Carvanha",
    "description": "Carvanha, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Dark"
    ]
  },
  {
    "id": 319,
    "name": "Sharpedo",
    "description": "Sharpedo, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Dark"
    ]
  },
  {
    "id": 320,
    "name": "Wailmer",
    "description": "Wailmer, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 321,
    "name": "Wailord",
    "description": "Wailord, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 322,
    "name": "Numel",
    "description": "Numel, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Ground"
    ]
  },
  {
    "id": 323,
    "name": "Camerupt",
    "description": "Camerupt, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Ground"
    ]
  },
  {
    "id": 324,
    "name": "Torkoal",
    "description": "Torkoal, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 325,
    "name": "Spoink",
    "description": "Spoink, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 326,
    "name": "Grumpig",
    "description": "Grumpig, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 327,
    "name": "Spinda",
    "description": "Spinda, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 328,
    "name": "Trapinch",
    "description": "Trapinch, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 329,
    "name": "Vibrava",
    "description": "Vibrava, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Dragon"
    ]
  },
  {
    "id": 330,
    "name": "Flygon",
    "description": "Flygon, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Dragon"
    ]
  },
  {
    "id": 331,
    "name": "Cacnea",
    "description": "Cacnea, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 332,
    "name": "Cacturne",
    "description": "Cacturne, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Dark"
    ]
  },
  {
    "id": 333,
    "name": "Swablu",
    "description": "Swablu, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 334,
    "name": "Altaria",
    "description": "Altaria, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Flying"
    ]
  },
  {
    "id": 335,
    "name": "Zangoose",
    "description": "Zangoose, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 336,
    "name": "Seviper",
    "description": "Seviper, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 337,
    "name": "Lunatone",
    "description": "Lunatone, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Psychic"
    ]
  },
  {
    "id": 338,
    "name": "Solrock",
    "description": "Solrock, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Psychic"
    ]
  },
  {
    "id": 339,
    "name": "Barboach",
    "description": "Barboach, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ground"
    ]
  },
  {
    "id": 340,
    "name": "Whiscash",
    "description": "Whiscash, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ground"
    ]
  },
  {
    "id": 341,
    "name": "Corphish",
    "description": "Corphish, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 342,
    "name": "Crawdaunt",
    "description": "Crawdaunt, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Dark"
    ]
  },
  {
    "id": 343,
    "name": "Baltoy",
    "description": "Baltoy, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Psychic"
    ]
  },
  {
    "id": 344,
    "name": "Claydol",
    "description": "Claydol, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Psychic"
    ]
  },
  {
    "id": 345,
    "name": "Lileep",
    "description": "Lileep, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Grass"
    ]
  },
  {
    "id": 346,
    "name": "Cradily",
    "description": "Cradily, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Grass"
    ]
  },
  {
    "id": 347,
    "name": "Anorith",
    "description": "Anorith, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Bug"
    ]
  },
  {
    "id": 348,
    "name": "Armaldo",
    "description": "Armaldo, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Bug"
    ]
  },
  {
    "id": 349,
    "name": "Feebas",
    "description": "Feebas, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 350,
    "name": "Milotic",
    "description": "Milotic, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 351,
    "name": "Castform",
    "description": "Castform, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 352,
    "name": "Kecleon",
    "description": "Kecleon, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 353,
    "name": "Shuppet",
    "description": "Shuppet, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost"
    ]
  },
  {
    "id": 354,
    "name": "Banette",
    "description": "Banette, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost"
    ]
  },
  {
    "id": 355,
    "name": "Duskull",
    "description": "Duskull, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost"
    ]
  },
  {
    "id": 356,
    "name": "Dusclops",
    "description": "Dusclops, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost"
    ]
  },
  {
    "id": 357,
    "name": "Tropius",
    "description": "Tropius, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Flying"
    ]
  },
  {
    "id": 358,
    "name": "Chimecho",
    "description": "Chimecho, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 359,
    "name": "Absol",
    "description": "Absol, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark"
    ]
  },
  {
    "id": 360,
    "name": "Wynaut",
    "description": "Wynaut, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 361,
    "name": "Snorunt",
    "description": "Snorunt, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 362,
    "name": "Glalie",
    "description": "Glalie, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 363,
    "name": "Spheal",
    "description": "Spheal, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice",
      "Water"
    ]
  },
  {
    "id": 364,
    "name": "Sealeo",
    "description": "Sealeo, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice",
      "Water"
    ]
  },
  {
    "id": 365,
    "name": "Walrein",
    "description": "Walrein, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice",
      "Water"
    ]
  },
  {
    "id": 366,
    "name": "Clamperl",
    "description": "Clamperl, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 367,
    "name": "Huntail",
    "description": "Huntail, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 368,
    "name": "Gorebyss",
    "description": "Gorebyss, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 369,
    "name": "Relicanth",
    "description": "Relicanth, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Rock"
    ]
  },
  {
    "id": 370,
    "name": "Luvdisc",
    "description": "Luvdisc, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 371,
    "name": "Bagon",
    "description": "Bagon, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 372,
    "name": "Shelgon",
    "description": "Shelgon, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 373,
    "name": "Salamence",
    "description": "Salamence, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Flying"
    ]
  },
  {
    "id": 374,
    "name": "Beldum",
    "description": "Beldum, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Psychic"
    ]
  },
  {
    "id": 375,
    "name": "Metang",
    "description": "Metang, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Psychic"
    ]
  },
  {
    "id": 376,
    "name": "Metagross",
    "description": "Metagross, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Psychic"
    ]
  },
  {
    "id": 377,
    "name": "Regirock",
    "description": "Regirock, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 378,
    "name": "Regice",
    "description": "Regice, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 379,
    "name": "Registeel",
    "description": "Registeel, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel"
    ]
  },
  {
    "id": 380,
    "name": "Latias",
    "description": "Latias, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Psychic"
    ]
  },
  {
    "id": 381,
    "name": "Latios",
    "description": "Latios, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Psychic"
    ]
  },
  {
    "id": 382,
    "name": "Kyogre",
    "description": "Kyogre, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 383,
    "name": "Groudon",
    "description": "Groudon, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 384,
    "name": "Rayquaza",
    "description": "Rayquaza, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Flying"
    ]
  },
  {
    "id": 385,
    "name": "Jirachi",
    "description": "Jirachi, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Psychic"
    ]
  },
  {
    "id": 386,
    "name": "Deoxys",
    "description": "Deoxys, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 387,
    "name": "Turtwig",
    "description": "Turtwig, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 388,
    "name": "Grotle",
    "description": "Grotle, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 389,
    "name": "Torterra",
    "description": "Torterra, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Ground"
    ]
  },
  {
    "id": 390,
    "name": "Chimchar",
    "description": "Chimchar, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 391,
    "name": "Monferno",
    "description": "Monferno, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Fighting"
    ]
  },
  {
    "id": 392,
    "name": "Infernape",
    "description": "Infernape, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Fighting"
    ]
  },
  {
    "id": 393,
    "name": "Piplup",
    "description": "Piplup, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 394,
    "name": "Prinplup",
    "description": "Prinplup, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 395,
    "name": "Empoleon",
    "description": "Empoleon, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Steel"
    ]
  },
  {
    "id": 396,
    "name": "Starly",
    "description": "Starly, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 397,
    "name": "Staravia",
    "description": "Staravia, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 398,
    "name": "Staraptor",
    "description": "Staraptor, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 399,
    "name": "Bidoof",
    "description": "Bidoof, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 400,
    "name": "Bibarel",
    "description": "Bibarel, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Water"
    ]
  },
  {
    "id": 401,
    "name": "Kricketot",
    "description": "Kricketot, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 402,
    "name": "Kricketune",
    "description": "Kricketune, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 403,
    "name": "Shinx",
    "description": "Shinx, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 404,
    "name": "Luxio",
    "description": "Luxio, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 405,
    "name": "Luxray",
    "description": "Luxray, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 406,
    "name": "Budew",
    "description": "Budew, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 407,
    "name": "Roserade",
    "description": "Roserade, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 408,
    "name": "Cranidos",
    "description": "Cranidos, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 409,
    "name": "Rampardos",
    "description": "Rampardos, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 410,
    "name": "Shieldon",
    "description": "Shieldon, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Steel"
    ]
  },
  {
    "id": 411,
    "name": "Bastiodon",
    "description": "Bastiodon, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Steel"
    ]
  },
  {
    "id": 412,
    "name": "Burmy",
    "description": "Burmy, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 413,
    "name": "Wormadam",
    "description": "Wormadam, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Grass"
    ]
  },
  {
    "id": 414,
    "name": "Mothim",
    "description": "Mothim, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 415,
    "name": "Combee",
    "description": "Combee, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 416,
    "name": "Vespiquen",
    "description": "Vespiquen, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 417,
    "name": "Pachirisu",
    "description": "Pachirisu, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 418,
    "name": "Buizel",
    "description": "Buizel, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 419,
    "name": "Floatzel",
    "description": "Floatzel, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 420,
    "name": "Cherubi",
    "description": "Cherubi, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 421,
    "name": "Cherrim",
    "description": "Cherrim, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 422,
    "name": "Shellos",
    "description": "Shellos, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 423,
    "name": "Gastrodon",
    "description": "Gastrodon, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ground"
    ]
  },
  {
    "id": 424,
    "name": "Ambipom",
    "description": "Ambipom, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 425,
    "name": "Drifloon",
    "description": "Drifloon, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Flying"
    ]
  },
  {
    "id": 426,
    "name": "Drifblim",
    "description": "Drifblim, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Flying"
    ]
  },
  {
    "id": 427,
    "name": "Buneary",
    "description": "Buneary, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 428,
    "name": "Lopunny",
    "description": "Lopunny, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 429,
    "name": "Mismagius",
    "description": "Mismagius, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost"
    ]
  },
  {
    "id": 430,
    "name": "Honchkrow",
    "description": "Honchkrow, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Flying"
    ]
  },
  {
    "id": 431,
    "name": "Glameow",
    "description": "Glameow, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 432,
    "name": "Purugly",
    "description": "Purugly, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 433,
    "name": "Chingling",
    "description": "Chingling, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 434,
    "name": "Stunky",
    "description": "Stunky, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Dark"
    ]
  },
  {
    "id": 435,
    "name": "Skuntank",
    "description": "Skuntank, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Dark"
    ]
  },
  {
    "id": 436,
    "name": "Bronzor",
    "description": "Bronzor, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Psychic"
    ]
  },
  {
    "id": 437,
    "name": "Bronzong",
    "description": "Bronzong, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Psychic"
    ]
  },
  {
    "id": 438,
    "name": "Bonsly",
    "description": "Bonsly, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 439,
    "name": "Mime Jr.",
    "description": "Mime Jr., a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Fairy"
    ]
  },
  {
    "id": 440,
    "name": "Happiny",
    "description": "Happiny, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 441,
    "name": "Chatot",
    "description": "Chatot, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 442,
    "name": "Spiritomb",
    "description": "Spiritomb, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Dark"
    ]
  },
  {
    "id": 443,
    "name": "Gible",
    "description": "Gible, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Ground"
    ]
  },
  {
    "id": 444,
    "name": "Gabite",
    "description": "Gabite, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Ground"
    ]
  },
  {
    "id": 445,
    "name": "Garchomp",
    "description": "Garchomp, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Ground"
    ]
  },
  {
    "id": 446,
    "name": "Munchlax",
    "description": "Munchlax, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 447,
    "name": "Riolu",
    "description": "Riolu, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 448,
    "name": "Lucario",
    "description": "Lucario, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting",
      "Steel"
    ]
  },
  {
    "id": 449,
    "name": "Hippopotas",
    "description": "Hippopotas, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 450,
    "name": "Hippowdon",
    "description": "Hippowdon, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 451,
    "name": "Skorupi",
    "description": "Skorupi, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Bug"
    ]
  },
  {
    "id": 452,
    "name": "Drapion",
    "description": "Drapion, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Dark"
    ]
  },
  {
    "id": 453,
    "name": "Croagunk",
    "description": "Croagunk, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Fighting"
    ]
  },
  {
    "id": 454,
    "name": "Toxicroak",
    "description": "Toxicroak, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Fighting"
    ]
  },
  {
    "id": 455,
    "name": "Carnivine",
    "description": "Carnivine, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 456,
    "name": "Finneon",
    "description": "Finneon, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 457,
    "name": "Lumineon",
    "description": "Lumineon, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 458,
    "name": "Mantyke",
    "description": "Mantyke, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Flying"
    ]
  },
  {
    "id": 459,
    "name": "Snover",
    "description": "Snover, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Ice"
    ]
  },
  {
    "id": 460,
    "name": "Abomasnow",
    "description": "Abomasnow, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Ice"
    ]
  },
  {
    "id": 461,
    "name": "Weavile",
    "description": "Weavile, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Ice"
    ]
  },
  {
    "id": 462,
    "name": "Magnezone",
    "description": "Magnezone, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric",
      "Steel"
    ]
  },
  {
    "id": 463,
    "name": "Lickilicky",
    "description": "Lickilicky, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 464,
    "name": "Rhyperior",
    "description": "Rhyperior, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Rock"
    ]
  },
  {
    "id": 465,
    "name": "Tangrowth",
    "description": "Tangrowth, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 466,
    "name": "Electivire",
    "description": "Electivire, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 467,
    "name": "Magmortar",
    "description": "Magmortar, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 468,
    "name": "Togekiss",
    "description": "Togekiss, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy",
      "Flying"
    ]
  },
  {
    "id": 469,
    "name": "Yanmega",
    "description": "Yanmega, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 470,
    "name": "Leafeon",
    "description": "Leafeon, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 471,
    "name": "Glaceon",
    "description": "Glaceon, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 472,
    "name": "Gliscor",
    "description": "Gliscor, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Flying"
    ]
  },
  {
    "id": 473,
    "name": "Mamoswine",
    "description": "Mamoswine, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice",
      "Ground"
    ]
  },
  {
    "id": 474,
    "name": "Porygon-Z",
    "description": "Porygon-Z, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 475,
    "name": "Gallade",
    "description": "Gallade, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Fighting"
    ]
  },
  {
    "id": 476,
    "name": "Probopass",
    "description": "Probopass, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Steel"
    ]
  },
  {
    "id": 477,
    "name": "Dusknoir",
    "description": "Dusknoir, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost"
    ]
  },
  {
    "id": 478,
    "name": "Froslass",
    "description": "Froslass, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice",
      "Ghost"
    ]
  },
  {
    "id": 479,
    "name": "Rotom",
    "description": "Rotom, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric",
      "Ghost"
    ]
  },
  {
    "id": 480,
    "name": "Uxie",
    "description": "Uxie, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 481,
    "name": "Mesprit",
    "description": "Mesprit, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 482,
    "name": "Azelf",
    "description": "Azelf, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 483,
    "name": "Dialga",
    "description": "Dialga, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Dragon"
    ]
  },
  {
    "id": 484,
    "name": "Palkia",
    "description": "Palkia, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Dragon"
    ]
  },
  {
    "id": 485,
    "name": "Heatran",
    "description": "Heatran, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Steel"
    ]
  },
  {
    "id": 486,
    "name": "Regigigas",
    "description": "Regigigas, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 487,
    "name": "Giratina",
    "description": "Giratina, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Dragon"
    ]
  },
  {
    "id": 488,
    "name": "Cresselia",
    "description": "Cresselia, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 489,
    "name": "Phione",
    "description": "Phione, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 490,
    "name": "Manaphy",
    "description": "Manaphy, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 491,
    "name": "Darkrai",
    "description": "Darkrai, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark"
    ]
  },
  {
    "id": 492,
    "name": "Shaymin",
    "description": "Shaymin, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 493,
    "name": "Arceus",
    "description": "Arceus, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 494,
    "name": "Victini",
    "description": "Victini, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Fire"
    ]
  },
  {
    "id": 495,
    "name": "Snivy",
    "description": "Snivy, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 496,
    "name": "Servine",
    "description": "Servine, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 497,
    "name": "Serperior",
    "description": "Serperior, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 498,
    "name": "Tepig",
    "description": "Tepig, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 499,
    "name": "Pignite",
    "description": "Pignite, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Fighting"
    ]
  },
  {
    "id": 500,
    "name": "Emboar",
    "description": "Emboar, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Fighting"
    ]
  },
  {
    "id": 501,
    "name": "Oshawott",
    "description": "Oshawott, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 502,
    "name": "Dewott",
    "description": "Dewott, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 503,
    "name": "Samurott",
    "description": "Samurott, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 504,
    "name": "Patrat",
    "description": "Patrat, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 505,
    "name": "Watchog",
    "description": "Watchog, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 506,
    "name": "Lillipup",
    "description": "Lillipup, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 507,
    "name": "Herdier",
    "description": "Herdier, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 508,
    "name": "Stoutland",
    "description": "Stoutland, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 509,
    "name": "Purrloin",
    "description": "Purrloin, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark"
    ]
  },
  {
    "id": 510,
    "name": "Liepard",
    "description": "Liepard, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark"
    ]
  },
  {
    "id": 511,
    "name": "Pansage",
    "description": "Pansage, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 512,
    "name": "Simisage",
    "description": "Simisage, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 513,
    "name": "Pansear",
    "description": "Pansear, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 514,
    "name": "Simisear",
    "description": "Simisear, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 515,
    "name": "Panpour",
    "description": "Panpour, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 516,
    "name": "Simipour",
    "description": "Simipour, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 517,
    "name": "Munna",
    "description": "Munna, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 518,
    "name": "Musharna",
    "description": "Musharna, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 519,
    "name": "Pidove",
    "description": "Pidove, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 520,
    "name": "Tranquill",
    "description": "Tranquill, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 521,
    "name": "Unfezant",
    "description": "Unfezant, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 522,
    "name": "Blitzle",
    "description": "Blitzle, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 523,
    "name": "Zebstrika",
    "description": "Zebstrika, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 524,
    "name": "Roggenrola",
    "description": "Roggenrola, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 525,
    "name": "Boldore",
    "description": "Boldore, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 526,
    "name": "Gigalith",
    "description": "Gigalith, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 527,
    "name": "Woobat",
    "description": "Woobat, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Flying"
    ]
  },
  {
    "id": 528,
    "name": "Swoobat",
    "description": "Swoobat, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Flying"
    ]
  },
  {
    "id": 529,
    "name": "Drilbur",
    "description": "Drilbur, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 530,
    "name": "Excadrill",
    "description": "Excadrill, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Steel"
    ]
  },
  {
    "id": 531,
    "name": "Audino",
    "description": "Audino, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 532,
    "name": "Timburr",
    "description": "Timburr, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 533,
    "name": "Gurdurr",
    "description": "Gurdurr, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 534,
    "name": "Conkeldurr",
    "description": "Conkeldurr, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 535,
    "name": "Tympole",
    "description": "Tympole, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 536,
    "name": "Palpitoad",
    "description": "Palpitoad, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ground"
    ]
  },
  {
    "id": 537,
    "name": "Seismitoad",
    "description": "Seismitoad, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ground"
    ]
  },
  {
    "id": 538,
    "name": "Throh",
    "description": "Throh, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 539,
    "name": "Sawk",
    "description": "Sawk, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 540,
    "name": "Sewaddle",
    "description": "Sewaddle, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Grass"
    ]
  },
  {
    "id": 541,
    "name": "Swadloon",
    "description": "Swadloon, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Grass"
    ]
  },
  {
    "id": 542,
    "name": "Leavanny",
    "description": "Leavanny, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Grass"
    ]
  },
  {
    "id": 543,
    "name": "Venipede",
    "description": "Venipede, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 544,
    "name": "Whirlipede",
    "description": "Whirlipede, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 545,
    "name": "Scolipede",
    "description": "Scolipede, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Poison"
    ]
  },
  {
    "id": 546,
    "name": "Cottonee",
    "description": "Cottonee, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Fairy"
    ]
  },
  {
    "id": 547,
    "name": "Whimsicott",
    "description": "Whimsicott, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Fairy"
    ]
  },
  {
    "id": 548,
    "name": "Petilil",
    "description": "Petilil, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 549,
    "name": "Lilligant",
    "description": "Lilligant, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 550,
    "name": "Basculin",
    "description": "Basculin, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 551,
    "name": "Sandile",
    "description": "Sandile, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Dark"
    ]
  },
  {
    "id": 552,
    "name": "Krokorok",
    "description": "Krokorok, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Dark"
    ]
  },
  {
    "id": 553,
    "name": "Krookodile",
    "description": "Krookodile, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Dark"
    ]
  },
  {
    "id": 554,
    "name": "Darumaka",
    "description": "Darumaka, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 555,
    "name": "Darmanitan",
    "description": "Darmanitan, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 556,
    "name": "Maractus",
    "description": "Maractus, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 557,
    "name": "Dwebble",
    "description": "Dwebble, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Rock"
    ]
  },
  {
    "id": 558,
    "name": "Crustle",
    "description": "Crustle, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Rock"
    ]
  },
  {
    "id": 559,
    "name": "Scraggy",
    "description": "Scraggy, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Fighting"
    ]
  },
  {
    "id": 560,
    "name": "Scrafty",
    "description": "Scrafty, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Fighting"
    ]
  },
  {
    "id": 561,
    "name": "Sigilyph",
    "description": "Sigilyph, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Flying"
    ]
  },
  {
    "id": 562,
    "name": "Yamask",
    "description": "Yamask, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost"
    ]
  },
  {
    "id": 563,
    "name": "Cofagrigus",
    "description": "Cofagrigus, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost"
    ]
  },
  {
    "id": 564,
    "name": "Tirtouga",
    "description": "Tirtouga, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Rock"
    ]
  },
  {
    "id": 565,
    "name": "Carracosta",
    "description": "Carracosta, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Rock"
    ]
  },
  {
    "id": 566,
    "name": "Archen",
    "description": "Archen, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Flying"
    ]
  },
  {
    "id": 567,
    "name": "Archeops",
    "description": "Archeops, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Flying"
    ]
  },
  {
    "id": 568,
    "name": "Trubbish",
    "description": "Trubbish, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 569,
    "name": "Garbodor",
    "description": "Garbodor, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison"
    ]
  },
  {
    "id": 570,
    "name": "Zorua",
    "description": "Zorua, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark"
    ]
  },
  {
    "id": 571,
    "name": "Zoroark",
    "description": "Zoroark, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark"
    ]
  },
  {
    "id": 572,
    "name": "Minccino",
    "description": "Minccino, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 573,
    "name": "Cinccino",
    "description": "Cinccino, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 574,
    "name": "Gothita",
    "description": "Gothita, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 575,
    "name": "Gothorita",
    "description": "Gothorita, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 576,
    "name": "Gothitelle",
    "description": "Gothitelle, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 577,
    "name": "Solosis",
    "description": "Solosis, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 578,
    "name": "Duosion",
    "description": "Duosion, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 579,
    "name": "Reuniclus",
    "description": "Reuniclus, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 580,
    "name": "Ducklett",
    "description": "Ducklett, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Flying"
    ]
  },
  {
    "id": 581,
    "name": "Swanna",
    "description": "Swanna, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Flying"
    ]
  },
  {
    "id": 582,
    "name": "Vanillite",
    "description": "Vanillite, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 583,
    "name": "Vanillish",
    "description": "Vanillish, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 584,
    "name": "Vanilluxe",
    "description": "Vanilluxe, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 585,
    "name": "Deerling",
    "description": "Deerling, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Grass"
    ]
  },
  {
    "id": 586,
    "name": "Sawsbuck",
    "description": "Sawsbuck, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Grass"
    ]
  },
  {
    "id": 587,
    "name": "Emolga",
    "description": "Emolga, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric",
      "Flying"
    ]
  },
  {
    "id": 588,
    "name": "Karrablast",
    "description": "Karrablast, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 589,
    "name": "Escavalier",
    "description": "Escavalier, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Steel"
    ]
  },
  {
    "id": 590,
    "name": "Foongus",
    "description": "Foongus, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 591,
    "name": "Amoonguss",
    "description": "Amoonguss, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Poison"
    ]
  },
  {
    "id": 592,
    "name": "Frillish",
    "description": "Frillish, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ghost"
    ]
  },
  {
    "id": 593,
    "name": "Jellicent",
    "description": "Jellicent, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Ghost"
    ]
  },
  {
    "id": 594,
    "name": "Alomomola",
    "description": "Alomomola, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 595,
    "name": "Joltik",
    "description": "Joltik, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Electric"
    ]
  },
  {
    "id": 596,
    "name": "Galvantula",
    "description": "Galvantula, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Electric"
    ]
  },
  {
    "id": 597,
    "name": "Ferroseed",
    "description": "Ferroseed, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Steel"
    ]
  },
  {
    "id": 598,
    "name": "Ferrothorn",
    "description": "Ferrothorn, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Steel"
    ]
  },
  {
    "id": 599,
    "name": "Klink",
    "description": "Klink, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel"
    ]
  },
  {
    "id": 600,
    "name": "Klang",
    "description": "Klang, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel"
    ]
  },
  {
    "id": 601,
    "name": "Klinklang",
    "description": "Klinklang, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel"
    ]
  },
  {
    "id": 602,
    "name": "Tynamo",
    "description": "Tynamo, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 603,
    "name": "Eelektrik",
    "description": "Eelektrik, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 604,
    "name": "Eelektross",
    "description": "Eelektross, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 605,
    "name": "Elgyem",
    "description": "Elgyem, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 606,
    "name": "Beheeyem",
    "description": "Beheeyem, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 607,
    "name": "Litwick",
    "description": "Litwick, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Fire"
    ]
  },
  {
    "id": 608,
    "name": "Lampent",
    "description": "Lampent, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Fire"
    ]
  },
  {
    "id": 609,
    "name": "Chandelure",
    "description": "Chandelure, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Fire"
    ]
  },
  {
    "id": 610,
    "name": "Axew",
    "description": "Axew, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 611,
    "name": "Fraxure",
    "description": "Fraxure, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 612,
    "name": "Haxorus",
    "description": "Haxorus, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 613,
    "name": "Cubchoo",
    "description": "Cubchoo, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 614,
    "name": "Beartic",
    "description": "Beartic, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 615,
    "name": "Cryogonal",
    "description": "Cryogonal, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 616,
    "name": "Shelmet",
    "description": "Shelmet, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 617,
    "name": "Accelgor",
    "description": "Accelgor, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 618,
    "name": "Stunfisk",
    "description": "Stunfisk, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Electric"
    ]
  },
  {
    "id": 619,
    "name": "Mienfoo",
    "description": "Mienfoo, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 620,
    "name": "Mienshao",
    "description": "Mienshao, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 621,
    "name": "Druddigon",
    "description": "Druddigon, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 622,
    "name": "Golett",
    "description": "Golett, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Ghost"
    ]
  },
  {
    "id": 623,
    "name": "Golurk",
    "description": "Golurk, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Ghost"
    ]
  },
  {
    "id": 624,
    "name": "Pawniard",
    "description": "Pawniard, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Steel"
    ]
  },
  {
    "id": 625,
    "name": "Bisharp",
    "description": "Bisharp, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Steel"
    ]
  },
  {
    "id": 626,
    "name": "Bouffalant",
    "description": "Bouffalant, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 627,
    "name": "Rufflet",
    "description": "Rufflet, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 628,
    "name": "Braviary",
    "description": "Braviary, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 629,
    "name": "Vullaby",
    "description": "Vullaby, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Flying"
    ]
  },
  {
    "id": 630,
    "name": "Mandibuzz",
    "description": "Mandibuzz, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Flying"
    ]
  },
  {
    "id": 631,
    "name": "Heatmor",
    "description": "Heatmor, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 632,
    "name": "Durant",
    "description": "Durant, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Steel"
    ]
  },
  {
    "id": 633,
    "name": "Deino",
    "description": "Deino, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Dragon"
    ]
  },
  {
    "id": 634,
    "name": "Zweilous",
    "description": "Zweilous, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Dragon"
    ]
  },
  {
    "id": 635,
    "name": "Hydreigon",
    "description": "Hydreigon, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Dragon"
    ]
  },
  {
    "id": 636,
    "name": "Larvesta",
    "description": "Larvesta, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Fire"
    ]
  },
  {
    "id": 637,
    "name": "Volcarona",
    "description": "Volcarona, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Fire"
    ]
  },
  {
    "id": 638,
    "name": "Cobalion",
    "description": "Cobalion, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Fighting"
    ]
  },
  {
    "id": 639,
    "name": "Terrakion",
    "description": "Terrakion, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Fighting"
    ]
  },
  {
    "id": 640,
    "name": "Virizion",
    "description": "Virizion, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Fighting"
    ]
  },
  {
    "id": 641,
    "name": "Tornadus",
    "description": "Tornadus, a Flying type pokemon, Description not available yet",
    "types": [
      "Flying"
    ]
  },
  {
    "id": 642,
    "name": "Thundurus",
    "description": "Thundurus, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric",
      "Flying"
    ]
  },
  {
    "id": 643,
    "name": "Reshiram",
    "description": "Reshiram, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Fire"
    ]
  },
  {
    "id": 644,
    "name": "Zekrom",
    "description": "Zekrom, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Electric"
    ]
  },
  {
    "id": 645,
    "name": "Landorus",
    "description": "Landorus, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground",
      "Flying"
    ]
  },
  {
    "id": 646,
    "name": "Kyurem",
    "description": "Kyurem, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Ice"
    ]
  },
  {
    "id": 647,
    "name": "Keldeo",
    "description": "Keldeo, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Fighting"
    ]
  },
  {
    "id": 648,
    "name": "Meloetta",
    "description": "Meloetta, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Psychic"
    ]
  },
  {
    "id": 649,
    "name": "Genesect",
    "description": "Genesect, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Steel"
    ]
  },
  {
    "id": 650,
    "name": "Chespin",
    "description": "Chespin, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 651,
    "name": "Quilladin",
    "description": "Quilladin, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 652,
    "name": "Chesnaught",
    "description": "Chesnaught, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Fighting"
    ]
  },
  {
    "id": 653,
    "name": "Fennekin",
    "description": "Fennekin, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 654,
    "name": "Braixen",
    "description": "Braixen, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 655,
    "name": "Delphox",
    "description": "Delphox, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Psychic"
    ]
  },
  {
    "id": 656,
    "name": "Froakie",
    "description": "Froakie, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 657,
    "name": "Frogadier",
    "description": "Frogadier, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 658,
    "name": "Greninja",
    "description": "Greninja, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Dark"
    ]
  },
  {
    "id": 659,
    "name": "Bunnelby",
    "description": "Bunnelby, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 660,
    "name": "Diggersby",
    "description": "Diggersby, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Ground"
    ]
  },
  {
    "id": 661,
    "name": "Fletchling",
    "description": "Fletchling, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 662,
    "name": "Fletchinder",
    "description": "Fletchinder, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Flying"
    ]
  },
  {
    "id": 663,
    "name": "Talonflame",
    "description": "Talonflame, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Flying"
    ]
  },
  {
    "id": 664,
    "name": "Scatterbug",
    "description": "Scatterbug, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 665,
    "name": "Spewpa",
    "description": "Spewpa, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 666,
    "name": "Vivillon",
    "description": "Vivillon, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Flying"
    ]
  },
  {
    "id": 667,
    "name": "Litleo",
    "description": "Litleo, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Normal"
    ]
  },
  {
    "id": 668,
    "name": "Pyroar",
    "description": "Pyroar, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Normal"
    ]
  },
  {
    "id": 669,
    "name": "Flabebe",
    "description": "Flabebe, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 670,
    "name": "Floette",
    "description": "Floette, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 671,
    "name": "Florges",
    "description": "Florges, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 672,
    "name": "Skiddo",
    "description": "Skiddo, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 673,
    "name": "Gogoat",
    "description": "Gogoat, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 674,
    "name": "Pancham",
    "description": "Pancham, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 675,
    "name": "Pangoro",
    "description": "Pangoro, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting",
      "Dark"
    ]
  },
  {
    "id": 676,
    "name": "Furfrou",
    "description": "Furfrou, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 677,
    "name": "Espurr",
    "description": "Espurr, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 678,
    "name": "Meowstic",
    "description": "Meowstic, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 679,
    "name": "Honedge",
    "description": "Honedge, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Ghost"
    ]
  },
  {
    "id": 680,
    "name": "Doublade",
    "description": "Doublade, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Ghost"
    ]
  },
  {
    "id": 681,
    "name": "Aegislash",
    "description": "Aegislash, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Ghost"
    ]
  },
  {
    "id": 682,
    "name": "Spritzee",
    "description": "Spritzee, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 683,
    "name": "Aromatisse",
    "description": "Aromatisse, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 684,
    "name": "Swirlix",
    "description": "Swirlix, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 685,
    "name": "Slurpuff",
    "description": "Slurpuff, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 686,
    "name": "Inkay",
    "description": "Inkay, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Psychic"
    ]
  },
  {
    "id": 687,
    "name": "Malamar",
    "description": "Malamar, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Psychic"
    ]
  },
  {
    "id": 688,
    "name": "Binacle",
    "description": "Binacle, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Water"
    ]
  },
  {
    "id": 689,
    "name": "Barbaracle",
    "description": "Barbaracle, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Water"
    ]
  },
  {
    "id": 690,
    "name": "Skrelp",
    "description": "Skrelp, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Water"
    ]
  },
  {
    "id": 691,
    "name": "Dragalge",
    "description": "Dragalge, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Dragon"
    ]
  },
  {
    "id": 692,
    "name": "Clauncher",
    "description": "Clauncher, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 693,
    "name": "Clawitzer",
    "description": "Clawitzer, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 694,
    "name": "Helioptile",
    "description": "Helioptile, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric",
      "Normal"
    ]
  },
  {
    "id": 695,
    "name": "Heliolisk",
    "description": "Heliolisk, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric",
      "Normal"
    ]
  },
  {
    "id": 696,
    "name": "Tyrunt",
    "description": "Tyrunt, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Dragon"
    ]
  },
  {
    "id": 697,
    "name": "Tyrantrum",
    "description": "Tyrantrum, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Dragon"
    ]
  },
  {
    "id": 698,
    "name": "Amaura",
    "description": "Amaura, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Ice"
    ]
  },
  {
    "id": 699,
    "name": "Aurorus",
    "description": "Aurorus, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Ice"
    ]
  },
  {
    "id": 700,
    "name": "Sylveon",
    "description": "Sylveon, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 701,
    "name": "Hawlucha",
    "description": "Hawlucha, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting",
      "Flying"
    ]
  },
  {
    "id": 702,
    "name": "Dedenne",
    "description": "Dedenne, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric",
      "Fairy"
    ]
  },
  {
    "id": 703,
    "name": "Carbink",
    "description": "Carbink, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Fairy"
    ]
  },
  {
    "id": 704,
    "name": "Goomy",
    "description": "Goomy, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 705,
    "name": "Sliggoo",
    "description": "Sliggoo, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 706,
    "name": "Goodra",
    "description": "Goodra, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 707,
    "name": "Klefki",
    "description": "Klefki, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Fairy"
    ]
  },
  {
    "id": 708,
    "name": "Phantump",
    "description": "Phantump, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Grass"
    ]
  },
  {
    "id": 709,
    "name": "Trevenant",
    "description": "Trevenant, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Grass"
    ]
  },
  {
    "id": 710,
    "name": "Pumpkaboo",
    "description": "Pumpkaboo, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Grass"
    ]
  },
  {
    "id": 711,
    "name": "Gourgeist",
    "description": "Gourgeist, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Grass"
    ]
  },
  {
    "id": 712,
    "name": "Bergmite",
    "description": "Bergmite, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 713,
    "name": "Avalugg",
    "description": "Avalugg, a Ice type pokemon, Description not available yet",
    "types": [
      "Ice"
    ]
  },
  {
    "id": 714,
    "name": "Noibat",
    "description": "Noibat, a Flying type pokemon, Description not available yet",
    "types": [
      "Flying",
      "Dragon"
    ]
  },
  {
    "id": 715,
    "name": "Noivern",
    "description": "Noivern, a Flying type pokemon, Description not available yet",
    "types": [
      "Flying",
      "Dragon"
    ]
  },
  {
    "id": 716,
    "name": "Xerneas",
    "description": "Xerneas, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 717,
    "name": "Yveltal",
    "description": "Yveltal, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Flying"
    ]
  },
  {
    "id": 718,
    "name": "Zygarde",
    "description": "Zygarde, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Ground"
    ]
  },
  {
    "id": 719,
    "name": "Diancie",
    "description": "Diancie, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Fairy"
    ]
  },
  {
    "id": 720,
    "name": "Hoopa",
    "description": "Hoopa, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Ghost"
    ]
  },
  {
    "id": 721,
    "name": "Volcanion",
    "description": "Volcanion, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Water"
    ]
  },
  {
    "id": 722,
    "name": "Rowlet",
    "description": "Rowlet, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Flying"
    ]
  },
  {
    "id": 723,
    "name": "Dartrix",
    "description": "Dartrix, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Flying"
    ]
  },
  {
    "id": 724,
    "name": "Decidueye",
    "description": "Decidueye, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Ghost"
    ]
  },
  {
    "id": 725,
    "name": "Litten",
    "description": "Litten, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 726,
    "name": "Torracat",
    "description": "Torracat, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire"
    ]
  },
  {
    "id": 727,
    "name": "Incineroar",
    "description": "Incineroar, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Dark"
    ]
  },
  {
    "id": 728,
    "name": "Popplio",
    "description": "Popplio, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 729,
    "name": "Brionne",
    "description": "Brionne, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 730,
    "name": "Primarina",
    "description": "Primarina, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Fairy"
    ]
  },
  {
    "id": 731,
    "name": "Pikipek",
    "description": "Pikipek, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 732,
    "name": "Trumbeak",
    "description": "Trumbeak, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 733,
    "name": "Toucannon",
    "description": "Toucannon, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Flying"
    ]
  },
  {
    "id": 734,
    "name": "Yungoos",
    "description": "Yungoos, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 735,
    "name": "Gumshoos",
    "description": "Gumshoos, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 736,
    "name": "Grubbin",
    "description": "Grubbin, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug"
    ]
  },
  {
    "id": 737,
    "name": "Charjabug",
    "description": "Charjabug, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Electric"
    ]
  },
  {
    "id": 738,
    "name": "Vikavolt",
    "description": "Vikavolt, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Electric"
    ]
  },
  {
    "id": 739,
    "name": "Crabrawler",
    "description": "Crabrawler, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 740,
    "name": "Crabominable",
    "description": "Crabominable, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting",
      "Ice"
    ]
  },
  {
    "id": 741,
    "name": "Oricorio",
    "description": "Oricorio, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Flying"
    ]
  },
  {
    "id": 742,
    "name": "Cutiefly",
    "description": "Cutiefly, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Fairy"
    ]
  },
  {
    "id": 743,
    "name": "Ribombee",
    "description": "Ribombee, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Fairy"
    ]
  },
  {
    "id": 744,
    "name": "Rockruff",
    "description": "Rockruff, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 745,
    "name": "Lycanroc",
    "description": "Lycanroc, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock"
    ]
  },
  {
    "id": 746,
    "name": "Wishiwashi",
    "description": "Wishiwashi, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 747,
    "name": "Mareanie",
    "description": "Mareanie, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Water"
    ]
  },
  {
    "id": 748,
    "name": "Toxapex",
    "description": "Toxapex, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Water"
    ]
  },
  {
    "id": 749,
    "name": "Mudbray",
    "description": "Mudbray, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 750,
    "name": "Mudsdale",
    "description": "Mudsdale, a Ground type pokemon, Description not available yet",
    "types": [
      "Ground"
    ]
  },
  {
    "id": 751,
    "name": "Dewpider",
    "description": "Dewpider, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Bug"
    ]
  },
  {
    "id": 752,
    "name": "Araquanid",
    "description": "Araquanid, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Bug"
    ]
  },
  {
    "id": 753,
    "name": "Fomantis",
    "description": "Fomantis, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 754,
    "name": "Lurantis",
    "description": "Lurantis, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 755,
    "name": "Morelull",
    "description": "Morelull, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Fairy"
    ]
  },
  {
    "id": 756,
    "name": "Shiinotic",
    "description": "Shiinotic, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Fairy"
    ]
  },
  {
    "id": 757,
    "name": "Salandit",
    "description": "Salandit, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Fire"
    ]
  },
  {
    "id": 758,
    "name": "Salazzle",
    "description": "Salazzle, a Poison type pokemon, Description not available yet",
    "types": [
      "Poison",
      "Fire"
    ]
  },
  {
    "id": 759,
    "name": "Stufful",
    "description": "Stufful, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Fighting"
    ]
  },
  {
    "id": 760,
    "name": "Bewear",
    "description": "Bewear, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Fighting"
    ]
  },
  {
    "id": 761,
    "name": "Bounsweet",
    "description": "Bounsweet, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 762,
    "name": "Steenee",
    "description": "Steenee, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 763,
    "name": "Tsareena",
    "description": "Tsareena, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass"
    ]
  },
  {
    "id": 764,
    "name": "Comfey",
    "description": "Comfey, a Fairy type pokemon, Description not available yet",
    "types": [
      "Fairy"
    ]
  },
  {
    "id": 765,
    "name": "Oranguru",
    "description": "Oranguru, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Psychic"
    ]
  },
  {
    "id": 766,
    "name": "Passimian",
    "description": "Passimian, a Fighting type pokemon, Description not available yet",
    "types": [
      "Fighting"
    ]
  },
  {
    "id": 767,
    "name": "Wimpod",
    "description": "Wimpod, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Water"
    ]
  },
  {
    "id": 768,
    "name": "Golisopod",
    "description": "Golisopod, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Water"
    ]
  },
  {
    "id": 769,
    "name": "Sandygast",
    "description": "Sandygast, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Ground"
    ]
  },
  {
    "id": 770,
    "name": "Palossand",
    "description": "Palossand, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Ground"
    ]
  },
  {
    "id": 771,
    "name": "Pyukumuku",
    "description": "Pyukumuku, a Water type pokemon, Description not available yet",
    "types": [
      "Water"
    ]
  },
  {
    "id": 772,
    "name": "Type: Null",
    "description": "Type: Null, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 773,
    "name": "Silvally",
    "description": "Silvally, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 774,
    "name": "Minior",
    "description": "Minior, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Flying"
    ]
  },
  {
    "id": 775,
    "name": "Komala",
    "description": "Komala, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal"
    ]
  },
  {
    "id": 776,
    "name": "Turtonator",
    "description": "Turtonator, a Fire type pokemon, Description not available yet",
    "types": [
      "Fire",
      "Dragon"
    ]
  },
  {
    "id": 777,
    "name": "Togedemaru",
    "description": "Togedemaru, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric",
      "Steel"
    ]
  },
  {
    "id": 778,
    "name": "Mimikyu",
    "description": "Mimikyu, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Fairy"
    ]
  },
  {
    "id": 779,
    "name": "Bruxish",
    "description": "Bruxish, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Psychic"
    ]
  },
  {
    "id": 780,
    "name": "Drampa",
    "description": "Drampa, a Normal type pokemon, Description not available yet",
    "types": [
      "Normal",
      "Dragon"
    ]
  },
  {
    "id": 781,
    "name": "Dhelmise",
    "description": "Dhelmise, a Ghost type pokemon, Description not available yet",
    "types": [
      "Ghost",
      "Grass"
    ]
  },
  {
    "id": 782,
    "name": "Jangmo-o",
    "description": "Jangmo-o, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon"
    ]
  },
  {
    "id": 783,
    "name": "Hakamo-o",
    "description": "Hakamo-o, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Fighting"
    ]
  },
  {
    "id": 784,
    "name": "Kommo-o",
    "description": "Kommo-o, a Dragon type pokemon, Description not available yet",
    "types": [
      "Dragon",
      "Fighting"
    ]
  },
  {
    "id": 785,
    "name": "Tapu Koko",
    "description": "Tapu Koko, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric",
      "Fairy"
    ]
  },
  {
    "id": 786,
    "name": "Tapu Lele",
    "description": "Tapu Lele, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Fairy"
    ]
  },
  {
    "id": 787,
    "name": "Tapu Bulu",
    "description": "Tapu Bulu, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Fairy"
    ]
  },
  {
    "id": 788,
    "name": "Tapu Fini",
    "description": "Tapu Fini, a Water type pokemon, Description not available yet",
    "types": [
      "Water",
      "Fairy"
    ]
  },
  {
    "id": 789,
    "name": "Cosmog",
    "description": "Cosmog, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 790,
    "name": "Cosmoem",
    "description": "Cosmoem, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 791,
    "name": "Solgaleo",
    "description": "Solgaleo, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Steel"
    ]
  },
  {
    "id": 792,
    "name": "Lunala",
    "description": "Lunala, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic",
      "Ghost"
    ]
  },
  {
    "id": 793,
    "name": "Nihilego",
    "description": "Nihilego, a Rock type pokemon, Description not available yet",
    "types": [
      "Rock",
      "Poison"
    ]
  },
  {
    "id": 794,
    "name": "Buzzwole",
    "description": "Buzzwole, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Fighting"
    ]
  },
  {
    "id": 795,
    "name": "Pheromosa",
    "description": "Pheromosa, a Bug type pokemon, Description not available yet",
    "types": [
      "Bug",
      "Fighting"
    ]
  },
  {
    "id": 796,
    "name": "Xurkitree",
    "description": "Xurkitree, an Electric type pokemon, Description not available yet",
    "types": [
      "Electric"
    ]
  },
  {
    "id": 797,
    "name": "Celesteela",
    "description": "Celesteela, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Flying"
    ]
  },
  {
    "id": 798,
    "name": "Kartana",
    "description": "Kartana, a Grass type pokemon, Description not available yet",
    "types": [
      "Grass",
      "Steel"
    ]
  },
  {
    "id": 799,
    "name": "Guzzlord",
    "description": "Guzzlord, a Dark type pokemon, Description not available yet",
    "types": [
      "Dark",
      "Dragon"
    ]
  },
  {
    "id": 800,
    "name": "Necrozma",
    "description": "Necrozma, a Psychic type pokemon, Description not available yet",
    "types": [
      "Psychic"
    ]
  },
  {
    "id": 801,
    "name": "Magearna",
    "description": "Magearna, a Steel type pokemon, Description not available yet",
    "types": [
      "Steel",
      "Fairy"
    ]
  }
]